DataProcessors/ЗагрузкаКонтрагентовИзТаблиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКонтрагентовИзТаблиц</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/КомпанияЧастноеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КомпанияЧастноеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧастноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Компания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Партнеры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаКонтрагентовИзТаблиц/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура НачатьЗагрузку()
	СтруктураПараметров = Новый Структура;
	
	ОписаниеОповещенияВозврата = Новый ОписаниеОповещения("ЗагрузкаИзФайлаПосле", ЭтотОбъект); 
	
	СтруктураПараметров.Вставить("Заголовок", "Загрузка контрагентов и партнеров"""); 
	СтруктураПараметров.Вставить("Колонки", Новый Массив);
	
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения, ПоЧемуИскать", 
															"ОсновнойМенеджер",
															Новый ОписаниеТипов("Строка"),
															"Основной менеджер",
															"Основной менеджер",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"Партнер",
															Новый ОписаниеТипов("Строка"),
															"Название ТТ",
															"Партнер",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"Контрагент",
															Новый ОписаниеТипов("Строка"),
															"Юр.лицо",
															"Контрагент",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"АдресТТ",
															Новый ОписаниеТипов("Строка"),
															"Адрес ТТ",
															"Адрес ТТ",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"ИНН",
															Новый ОписаниеТипов("Строка"),
															"ИНН",
															"ИНН",
															Истина
														)
										);	
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"Регион",
															Новый ОписаниеТипов("Строка"),
															"Регион доставки",
															"ИНН",
															Истина
														)
										);
										
	ЗагрузкаДанныхИзТаблицКлиент.ОткрытьФормуЗагрузкиИзТаблиц(СтруктураПараметров, ЭтаФорма, ОписаниеОповещенияВозврата);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИзФайлаПосле(СтруктураПараметров, ДополнительныеПараметры) Экспорт  
	
	Если ЗначениеЗаполнено(СтруктураПараметров) Тогда 
		Адрес = СтруктураПараметров.АдресВременногоХранилищаТаблицы; 
		ЗагрузитьТаблицуНаСервере(Адрес);  	
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ЗагрузитьТаблицуНаСервере(Адрес) 

	ТаблицаКЗагрузке = ПолучитьИзВременногоХранилища(Адрес);  
	 
	//Сообщить("Очищаем справочники");
	//ОчиститьСправочники(); 
	
	ЗагрузитьМенеджеров(ТаблицаКЗагрузке);
	ЗагрузитьЗоныДоставки(ТаблицаКЗагрузке);
	ЗагрузитьПартнеров(ТаблицаКЗагрузке);
	ЗагрузитьКонтрагентов(ТаблицаКЗагрузке);
	
	Сообщить("Готово");

КонецПроцедуры  

&НаСервере
Процедура ОчиститьСправочники()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗоныДоставки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗоныДоставки КАК ЗоныДоставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|	
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Партнеры.Ссылка
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбъектСпр = Выборка.Ссылка.ПолучитьОбъект(); 
		ОбъектСпр.ПометкаУдаления = Истина;
		ОбъектСпр.Записать();
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьМенеджеров(ТаблицаКЗагрузке)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	Т.Партнер КАК Партнер
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	&Т КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(Вт.ОсновнойМенеджер КАК СТРОКА(500)) КАК ОсновнойМенеджер
		|ИЗ
		|	Вт КАК Вт";
	
	Запрос.УстановитьПараметр("Т", ТаблицаКЗагрузке);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаМенеджеры = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаМенеджеры.Следующий() Цикл 
		Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ВыборкаМенеджеры.ОсновнойМенеджер);
		
		Если не ЗначениеЗаполнено(Пользователь) Тогда	
			Элемент = Справочники.Пользователи.СоздатьЭлемент();
			Элемент.Наименование = ВыборкаМенеджеры.ОсновнойМенеджер;
			Элемент.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 


&НаСервере
Процедура ЗагрузитьЗоныДоставки(ТаблицаКЗагрузке)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Регион КАК АдресДоставки
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	&Т КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(Вт.АдресДоставки КАК СТРОКА(500)) КАК АдресДоставки
		|ИЗ
		|	Вт КАК Вт";
	
	Запрос.УстановитьПараметр("Т", ТаблицаКЗагрузке);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ЗонаДоставки = Справочники.ЗоныДоставки.НайтиПоНаименованию(Выборка.АдресДоставки);
		
		Если не ЗначениеЗаполнено(ЗонаДоставки) Тогда	
			Элемент = Справочники.ЗоныДоставки.СоздатьЭлемент();
			Элемент.Наименование = Выборка.АдресДоставки;
			Элемент.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьПартнеров(ТаблицаКЗагрузке)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Т.ОсновнойМенеджер КАК СТРОКА(100)) КАК ОсновнойМенеджер,
		|	ВЫРАЗИТЬ(Т.Партнер КАК СТРОКА(500)) КАК Партнер,
		|	ВЫРАЗИТЬ(Т.Инн КАК СТРОКА(12)) КАК Инн,
		|	ВЫРАЗИТЬ(Т.Регион КАК СТРОКА(500)) КАК Регион, 
		|	ВЫРАЗИТЬ(Т.АдресТТ КАК СТРОКА(500)) КАК АдресТТ 
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	&Т КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт.Инн КАК Инн,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(Вт.Партнер) > 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НуженГК
		|ПОМЕСТИТЬ ВтНуженГК
		|ИЗ
		|	Вт КАК Вт
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт.Инн
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Вт.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	Вт.Партнер КАК Партнер,
		|	ВтНуженГК.НуженГК КАК НуженГК,
		|	Вт.Регион КАК Регион,
		|	Вт.АдресТТ КАК АдресТТ
		|ИЗ
		|	Вт КАК Вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНуженГК КАК ВтНуженГК
		|		ПО Вт.Инн = ВтНуженГК.Инн";
	
	Запрос.УстановитьПараметр("Т", ТаблицаКЗагрузке);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		Элемент = Справочники.Партнеры.СоздатьЭлемент();
		Элемент.ОсновнойМенеджер = Справочники.Пользователи.НайтиПоНаименованию(Выборка.ОсновнойМенеджер);
		Элемент.Наименование = СокрЛП(Выборка.Партнер); 
		Элемент.НаименованиеПолное = СокрЛП(Выборка.Партнер); 
		Элемент.ЗонаДоставки = Справочники.ЗоныДоставки.НайтиПоНаименованию(Выборка.Регион);
		Элемент.Клиент = Истина;
		Элемент.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
		
		СтрАдрес = Элемент.КонтактнаяИнформация.Добавить();
		СтрАдрес.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтрАдрес.Вид = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
		СтрАдрес.Представление = СокрЛП(Выборка.АдресТТ);
		СтрАдрес.Страна = "РОССИЯ";  
		СтрАдрес.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
		
		Если Выборка.НуженГК Тогда 
			
			ПозицияСкобки = СтрНайти(Выборка.Партнер, "("); 
			Если ПозицияСкобки > 0 Тогда
				Результат = Лев(Выборка.Партнер, ПозицияСкобки - 1);
			Иначе
				Результат = Выборка.Партнер;
			КонецЕсли;    
			НаименованиеГК = СокрЛП(Результат); 
			
			ГК = Справочники.Партнеры.НайтиПоРеквизиту("НаименованиеПолное", НаименованиеГК);
			
			Если не ЗначениеЗаполнено(ГК) Тогда
				ЭлементГК = Справочники.Партнеры.СоздатьЭлемент();
				ЭлементГК.ОсновнойМенеджер = Справочники.Пользователи.НайтиПоНаименованию(Выборка.ОсновнойМенеджер);
				ЭлементГК.Наименование = НаименованиеГК;
				ЭлементГК.НаименованиеПолное = НаименованиеГК; 
				ЭлементГК.Клиент = Истина;
				ЭлементГК.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
				ЭлементГК.Записать();
				ГК = ЭлементГК.Ссылка;
			КонецЕсли;
			
			Элемент.Родитель = ГК;
			
		КонецЕсли;
		
		Элемент.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКонтрагентов(ТаблицаКЗагрузке)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Т.Контрагент КАК СТРОКА(100)) КАК Контрагент,
		|	ВЫРАЗИТЬ(Т.Партнер КАК СТРОКА(500)) КАК Партнер,
		|	ВЫРАЗИТЬ(Т.Инн КАК СТРОКА(12)) КАК Инн
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	&Т КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт.Инн КАК Инн,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(Вт.Партнер) > 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьГК
		|ПОМЕСТИТЬ ВтЕстьГК
		|ИЗ
		|	Вт КАК Вт
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт.Инн
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Вт.Контрагент КАК Контрагент,
		|	МИНИМУМ(Вт.Партнер) КАК Партнер,
		|	МИНИМУМ(Вт.Инн) КАК ИНН,
		|	ВтЕстьГК.ЕстьГК КАК ЕстьГК
		|ИЗ
		|	Вт КАК Вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЕстьГК КАК ВтЕстьГК
		|		ПО Вт.Инн = ВтЕстьГК.Инн
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт.Контрагент,
		|	ВтЕстьГК.ЕстьГК,
		|	Вт.Инн";
	
	Запрос.УстановитьПараметр("Т", ТаблицаКЗагрузке);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Элемент = Справочники.Контрагенты.СоздатьЭлемент();  
		Если Выборка.ЕстьГК Тогда
			ПозицияСкобки = СтрНайти(Выборка.Партнер, "("); 
			Если ПозицияСкобки > 0 Тогда
				Результат = Лев(Выборка.Партнер, ПозицияСкобки - 1);
			Иначе
				Результат = Выборка.Партнер;
			КонецЕсли;    
			НаименованиеГК = СокрЛП(Результат); 
			
			ГК = Справочники.Партнеры.НайтиПоРеквизиту("НаименованиеПолное", НаименованиеГК);

			Элемент.Партнер = ГК;
		Иначе 
			Элемент.Партнер = Справочники.Партнеры.НайтиПоРеквизиту("НаименованиеПолное", Выборка.Партнер);
		КонецЕсли;
		Элемент.Наименование = СокрЛП(Выборка.Контрагент);
		
		ИНН = СокрЛП(Выборка.ИНН);
		Элемент.ИНН = ИНН;
		
		Если СтрДлина(ИНН) = 10 Тогда 
			Элемент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;	
		ИначеЕсли СтрДлина(ИНН) = 12 Тогда 
			Элемент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель;
		КонецЕсли;
		Элемент.Записать();
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьЮрАдресаНаСервере(Адрес)
	
	ТаблицаКЗагрузке = ПолучитьИзВременногоХранилища(Адрес); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Т.Адрес КАК СТРОКА(100)) КАК Адрес,
		|	ВЫРАЗИТЬ(Т.Инн КАК СТРОКА(12)) КАК Инн
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	&Т КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Вт.Адрес КАК Адрес,
		|	Вт.Инн КАК Инн
		|ИЗ
		|	Вт КАК Вт";
	
	Запрос.УстановитьПараметр("Т", ТаблицаКЗагрузке);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ИНН = СокрЛП(Выборка.ИНН);
		Если СтрДлина(ИНН) = 12 Тогда 
			
			КонтрагентОбъект = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН).ПолучитьОбъект();  
			
			СтрАдрес = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			СтрАдрес.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			СтрАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
			СтрАдрес.Представление = СокрЛП(Выборка.Адрес);
			СтрАдрес.Страна = "РОССИЯ";  
			СтрАдрес.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
			
			КонтрагентОбъект.Записать();
		КонецЕсли;
		  
	КонецЦикла;
		
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьЮрАдреса(Команда) 
	
	СтруктураПараметров = Новый Структура;
	
	ОписаниеОповещенияВозврата = Новый ОписаниеОповещения("ЗагрузкаЮрАдресовПосле", ЭтотОбъект); 
	
	СтруктураПараметров.Вставить("Заголовок", "Загрузка юр адресов контрагентов"""); 
	СтруктураПараметров.Вставить("Колонки", Новый Массив);
	
				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"Адрес",
															Новый ОписаниеТипов("Строка"),
															"Адрес",
															"Адрес",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"ИНН",
															Новый ОписаниеТипов("Строка"),
															"ИНН",
															"ИНН",
															Истина
														)
										);	
										
	ЗагрузкаДанныхИзТаблицКлиент.ОткрытьФормуЗагрузкиИзТаблиц(СтруктураПараметров, ЭтаФорма, ОписаниеОповещенияВозврата);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗагрузкаЮрАдресовПосле(СтруктураПараметров, ДополнительныеПараметры) Экспорт  
	
	Если ЗначениеЗаполнено(СтруктураПараметров) Тогда 
		Адрес = СтруктураПараметров.АдресВременногоХранилищаТаблицы; 
		ЗагрузитьЮрАдресаНаСервере(Адрес);  	
	КонецЕсли;
	
КонецПроцедуры
